-- phpMyAdmin SQL Dump
-- version 4.9.7
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Апр 28 2024 г., 05:44
-- Версия сервера: 5.7.21-20-beget-5.7.21-20-1-log
-- Версия PHP: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `cfb7910i_ht`
--

-- --------------------------------------------------------

--
-- Структура таблицы `regs`
--
-- Создание: Апр 27 2024 г., 10:52
-- Последнее обновление: Апр 28 2024 г., 00:08
--

DROP TABLE IF EXISTS `regs`;
CREATE TABLE `regs` (
  `key` varchar(512) NOT NULL DEFAULT 'aex32ex23e23fv423cv5436bn4567y8ihgyt5e,m6rvb5ctasww34w4sw3wmnb3c54r346',
  `login` varchar(128) NOT NULL,
  `pass` varchar(256) NOT NULL,
  `fio` varchar(512) NOT NULL,
  `time` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `regs`
--

INSERT INTO `regs` (`key`, `login`, `pass`, `fio`, `time`) VALUES
('=oRyOk=HHBZzaMDK-S5KpZkcPbq5mw2ERiZSrCnngPWwaXRRSg-1aPmB=2TnbJM3', 'l123', '0000', 'ee eeeo eeeshka', 1714244009);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--
-- Создание: Апр 27 2024 г., 19:20
-- Последнее обновление: Апр 28 2024 г., 00:08
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `uid` int(11) NOT NULL,
  `login` varchar(128) NOT NULL,
  `pass` varchar(256) NOT NULL,
  `fio` varchar(256) NOT NULL,
  `votes` int(11) NOT NULL DEFAULT '0',
  `bd` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`uid`, `login`, `pass`, `fio`, `votes`, `bd`) VALUES
(1, 'rustgame', '2121', 'Serov Albert Ildarovich', 0, 1022788800),
(2, 'viktor', '7878', 'Smirnova V.A.', 0, 0),
(3, 'l123', '0000', 'ee eeeo eeeshka', 0, 0),
(5, 'lalka', 'l123', 'dmujhyrbgdcgef', 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `ways`
--
-- Создание: Апр 27 2024 г., 20:50
-- Последнее обновление: Апр 28 2024 г., 02:36
--

DROP TABLE IF EXISTS `ways`;
CREATE TABLE `ways` (
  `id` int(11) NOT NULL,
  `name` varchar(128) NOT NULL,
  `votes` int(11) NOT NULL DEFAULT '0',
  `users` varchar(2048) NOT NULL DEFAULT '[]'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `ways`
--

INSERT INTO `ways` (`id`, `name`, `votes`, `users`) VALUES
(1, 'Республика Адыгея (Адыгея)', 0, '[]'),
(2, 'Республика Башкортостан', 385, '[]'),
(3, 'Республика Бурятия', 0, '[]'),
(4, 'Республика Алтай', 0, '[]'),
(5, 'Республика Дагестан', 0, '[]'),
(6, 'Республика Ингушетия', 0, '[]'),
(7, 'Кабардино-Балкарская Республика', 0, '[]'),
(8, 'Республика Калмыкия', 0, '[]'),
(9, 'Карачаево-Черкесская Республика', 0, '[]'),
(10, 'Республика Карелия', 0, '[]'),
(11, 'Республика Коми', 0, '[]'),
(12, 'Республика Марий Эл', 0, '[]'),
(13, 'Республика Мордовия', 0, '[]'),
(14, 'Республика Саха (Якутия)', 0, '[]'),
(15, 'Республика Северная Осетия — Алания', 0, '[]'),
(16, 'Республика Татарстан (Татарстан)', 0, '[]'),
(17, 'Республика Тыва', 0, '[]'),
(18, 'Удмуртская Республика', 0, '[]'),
(19, 'Республика Хакасия', 0, '[]'),
(20, 'Чеченская Республика', 0, '[]'),
(21, 'Чувашская Республика —  Чувашия', 0, '[]'),
(22, 'Алтайский край', 0, '[]'),
(23, 'Краснодарский край', 0, '[]'),
(24, 'Красноярский край', 0, '[]'),
(25, 'Приморский край', 0, '[]'),
(26, 'Ставропольский край', 0, '[]'),
(27, 'Хабаровский край', 0, '[]'),
(28, 'Амурская область', 0, '[]'),
(29, 'Архангельская область', 0, '[]'),
(30, 'Астраханская область', 0, '[]'),
(31, 'Белгородская область', 0, '[]'),
(32, 'Брянская область', 0, '[]'),
(33, 'Владимирская область', 0, '[]'),
(34, 'Волгоградская область', 0, '[]'),
(35, 'Вологодская область', 0, '[]'),
(36, 'Воронежская область', 0, '[]'),
(37, 'Ивановская область', 0, '[]'),
(38, 'Иркутская область', 0, '[]'),
(39, 'Калининградская область', 0, '[]'),
(40, 'Калужская область', 0, '[]'),
(41, 'Камчатский край', 0, '[]'),
(42, 'Кемеровская область — Кузбасс', 0, '[]'),
(43, 'Кировская область', 0, '[]'),
(44, 'Костромская область', 0, '[]'),
(45, 'Курганская область', 0, '[]'),
(46, 'Курская область', 0, '[]'),
(47, 'Ленинградская область', 0, '[]'),
(48, 'Липецкая область', 0, '[]'),
(49, 'Магаданская область', 0, '[]'),
(50, 'Московская область', 0, '[]'),
(51, 'Мурманская область', 0, '[]'),
(52, 'Нижегородская область', 0, '[]'),
(53, 'Новгородская область', 0, '[]'),
(54, 'Новосибирская область', 0, '[]'),
(55, 'Омская область', 20, '[]'),
(56, 'Оренбургская область', 0, '[]'),
(57, 'Орловская область', 33, '[]'),
(58, 'Пензенская область', 0, '[]'),
(59, 'Пермский край', 4, '[]'),
(60, 'Псковская область', 0, '[]'),
(61, 'Ростовская область', 0, '[]'),
(62, 'Рязанская область', 40, '[]'),
(63, 'Самарская область', 0, '[]'),
(64, 'Саратовская область', 0, '[]'),
(65, 'Сахалинская область', 9, '[]'),
(66, 'Свердловская область', 0, '[]'),
(67, 'Смоленская область', 0, '[]'),
(68, 'Тамбовская область', 12, '[]'),
(69, 'Тверская область', 0, '[]'),
(70, 'Томская область', 0, '[]'),
(71, 'Тульская область', 11, '[]'),
(72, 'Тюменская область', 0, '[]'),
(73, 'Ульяновская область', 0, '[]'),
(74, 'Челябинская область', 0, '[]'),
(75, 'Забайкальский край', 0, '[]'),
(76, 'Ярославская область', 0, '[]'),
(77, 'Москва', 0, '[]'),
(78, 'Санкт-Петербург', 0, '[]'),
(79, 'Еврейская автономная область', 0, '[]'),
(80, 'Донецкая Народная Республика', 0, '[]'),
(81, 'Луганская Народная Республика', 0, '[]'),
(82, 'Республика Крым', 0, '[]'),
(83, 'Ненецкий автономный округ', 0, '[]'),
(84, 'Херсонская область', 0, '[]'),
(85, 'Запорожская область', 0, '[]'),
(86, 'Ханты-Мансийский автономный округ — Югра', 0, '[]'),
(87, 'Чукотский автономный округ', 0, '[]'),
(89, 'Ямало-Ненецкий автономный округ', 0, '[]');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `regs`
--
ALTER TABLE `regs`
  ADD PRIMARY KEY (`key`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`uid`);

--
-- Индексы таблицы `ways`
--
ALTER TABLE `ways`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `uid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `ways`
--
ALTER TABLE `ways`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=90;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
